src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>ПользовательОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетеорИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УИ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/ОбновлениеAUTHORSСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьОбновлениеФайловAUTHORSПоПараметрам(Пользователи) Экспорт

	Если ТипЗнч(Пользователи) = Тип("Массив") Тогда
		МассивОбъектов = Пользователи;
	Иначе	
	    МассивОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Пользователи);
	КонецЕсли; 
	
	ЕстьОшибка = Ложь;
	
	ПодготовленныеПараметры = ПараметрыДляОбновленияAUTHORS(МассивОбъектов);
	
	МассивФайловыхОбъектов = НайтиФайлы(РаботаСХранилищами.КаталогGit1С(), "*");
	Для каждого Файл Из МассивФайловыхОбъектов Цикл
		Если НЕ Файл.ЭтоКаталог() Тогда
		    Продолжить;
		КонецЕсли; 
		
		Попытка
			ВыполнитьОбновлениеФайловAUTHORSВГитРепозитории(Файл.ПолноеИмя, ПодготовленныеПараметры);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Ошибка обновления AUTHORS в гит-репозитарии %1 по причине: %2", 
																Файл.ПолноеИмя, 
																ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())), , , , ЕстьОшибка);
		КонецПопытки; 
	КонецЦикла; 
	
	Если НЕ ЕстьОшибка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обновление успешно выполнено"); 
	КонецЕсли; 
	
КонецПроцедуры
	
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыДляОбновленияAUTHORS(МассивОбъектов) 

	РезультатФункции = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.Код КАК Код,
		|	Пользователи.Наименование КАК Наименование,
		|	Пользователи.email КАК email
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.email) Тогда
			Продолжить;
		КонецЕсли; 
		
		ПараметрыПользователя = Новый Структура;
		ПараметрыПользователя.Вставить("Логин", 						СокрЛП(Выборка.Код));
		ПараметрыПользователя.Вставить("АдресЭлектроннойПочты", 		Выборка.email);
		ПараметрыПользователя.Вставить("СтрокаОбъявленияПользователя", 	СтрШаблон("%1=%1 <%2>", СокрЛП(Выборка.Код), Выборка.email));
		
		РезультатФункции.Добавить(ПараметрыПользователя);
	КонецЦикла;

	Возврат РезультатФункции;

КонецФункции 

Процедура ВыполнитьОбновлениеФайловAUTHORSВГитРепозитории(ПолноеИмяКаталогаГитРепозитория, ПараметрыПользователей)
	
	НайденныеФайлы = НайтиФайлы(ПолноеИмяКаталогаГитРепозитория, ИмяФайлаAUTHORS(), Истина);
	
	Для каждого Файл Из НайденныеФайлы Цикл
		Если Файл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли; 
		
		ЕстьДанныеДляЗаписи = Ложь;
		
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(Файл.ПолноеИмя);
		ДанныеСтрокой = ТекстовыйДокумент.ПолучитьТекст();
		
		Для каждого ПараметрыПользователя Из ПараметрыПользователей Цикл
			Если СтрНайти(ДанныеСтрокой, СтрШаблон("%1=", ПараметрыПользователя.Логин)) Тогда
			    Продолжить;
			КонецЕсли; 
			
		    ТекстовыйДокумент.ДобавитьСтроку(ПараметрыПользователя.СтрокаОбъявленияПользователя);
			ЕстьДанныеДляЗаписи = Истина;
		КонецЦикла; 
		
		Если ЕстьДанныеДляЗаписи Тогда
			ТекстовыйДокумент.Записать(Файл.ПолноеИмя);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

Функция ИмяФайлаAUTHORS()
	Возврат "AUTHORS";	
КонецФункции 

#КонецОбласти
